---
kind: property
id: P:Autodesk.Revit.DB.Parameter.IsReadOnly
zh: 参数、共享参数
source: html/6b0e59ba-261f-65ab-901c-b9f2f033f651.htm
---
# Autodesk.Revit.DB.Parameter.IsReadOnly Property

**中文**: 参数、共享参数

Get the readonly property of the parameter.

## Syntax (C#)
```csharp
public override bool IsReadOnly { get; }
```

## Remarks
This function can be used to check if the parameter is read-only.